ЕРПУХАстенд.cbr_Основной/src/Catalogs/cbr_ПредопределенныеЗначенияКонстант/cbr_ПредопределенныеЗначенияКонстант.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>cbr_ПредопределенныеЗначенияКонстант</name>
  <comment>//cbr-larkovgeorg 15.02.2026 СКЛ.12(по указанию архитектора)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Паллет</name>
      <description>Паллет</description>
    </items>
    <items>
      <name>ВыходнойКонтроль</name>
      <description>Выходной контроль</description>
    </items>
    <items>
      <name>СпецификацияДействует</name>
      <description>Спецификация действует</description>
    </items>
    <items>
      <name>РольОтветственныйЗаСпецификации</name>
      <description>Роль ответственный за спецификации</description>
    </items>
    <items>
      <name>ЕвроПаллет</name>
      <description>Евро паллет</description>
    </items>
    <items>
      <name>АмерПаллет</name>
      <description>Амер паллет</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.НаборыУпаковок</types>
      <types>String</types>
      <types>EnumRef.СтатусыСпецификаций</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ЕРПУХАстенд.cbr_Основной/src/Catalogs/cbr_ПредопределенныеЗначенияКонстант/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ cbr-larkovgeorg 25.02.26 СКЛ.12
	Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
	
	ОграничитьТипЗначений();
		
КонецПроцедуры //-- cbr-larkovgeorg 25.02.26 СКЛ.12

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОграничитьТипЗначений()
	//++ cbr-larkovgeorg 25.02.26 СКЛ.12
	
	Если Объект.Ссылка = Справочники.cbr_ПредопределенныеЗначенияКонстант.Паллет Тогда
		
		Элементы.Значение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения");
		Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
			
	ИначеЕсли Объект.Ссылка = Справочники.cbr_ПредопределенныеЗначенияКонстант.ЕвроПаллет 
		ИЛИ	Объект.Ссылка = Справочники.cbr_ПредопределенныеЗначенияКонстант.АмерПаллет Тогда
		
		Элементы.Значение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения");
		Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
		
	КонецЕсли;
	
КонецПроцедуры //-- cbr-larkovgeorg 25.02.26 СКЛ.12

#КонецОбласти
